Revit 2026 API

# WorksetIsVisibleByDefault Property

---

Whether the workset is visible by default.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool IsVisibleByDefault { get; }
```
```vb
Public ReadOnly Property IsVisibleByDefault As Boolean
	Get
```
```cpp
public:
property bool IsVisibleByDefault {
	bool get ();
}
```
```fsharp
member IsVisibleByDefault : bool with get
```

#### Property Value

Boolean

| Exception | Condition |
| --- | --- |
| InvalidOperationException | WorksetDefaultVisibilitySettings is not applicable to family documents. |

#### Reference

Workset Class

Autodesk.Revit.DB Namespace